api/app/controllers/tasks_controller.rb

    task = Task.find(task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    task = Task.find(task_id)

    if task.submitted?
      return render(
        json: { success: false, errors: 'Task already submitted' },
        status: 403
      )
    end

    success = task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "submitted" = ?, "answer" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["submitted", 1], ["answer", "dggdg"], ["updated_at", "2022-02-03 12:08:31.210678"], ["id", 1]]